# -*-coding: Utf-8 -*-
# @File : 02常量和变量 .py
# author: Chimengmeng
# blog_url : https://www.cnblogs.com/dream-ze/
# Time：2024/7/16

# 【一】注释
# 【1】什么是注释？
# 注释就是对代码的解释和说明，注释的内容不会被作为代码执行。
# 在前期学习的过程中建议多加注释
# 今天能看懂的代码  晚上睡一觉明天就不认识了

# 【2】如何进行注释
# 单行注释
# 语法 # + 注释内容

# 多行注释
# 三个双引号或者三个单引号 回车
'''
这是多行注释
'''

"""
这是多行注释
"""

'''
"""
"""
'''

# 【二】变量
# 【1】什么是变量
# ● 变量是用于存储数据值的标识符，可以通过变量名访问和操作这些数据。
#   ○ 在程序中，变量就像一个容器，用于存储和管理数据。
# ● 变量就是可以变化的量，量指的是事物的状态
#   ○ 比如人的年龄、性别，游戏角色的等级、金钱等等

# 【2】为什么要有变量
# ● 变量的存在使得程序能够更灵活地处理数据，而不是每次都硬编码数据值。
# ● 通过使用变量，程序可以在运行时根据需要存储和修改数据，从而实现动态的状态和行为。
# ● 为了让计算机能够像人一样去记忆事物的某种状态，并且状态是可以发生变化的
# ● 变量在程序中扮演着存储和传递信息的角色
#   ○ 程序执行的本质就是一系列状态的变化，变是程序执行的直接体现
#   ○ 所以我们需要有一种机制能够反映或者说是保存下来程序执行时状态，以及状态的变化

# res = 1       1
# res = 1 + 1   2

# 【3】变量的定义与调用
# ● 变量的定义由三部分组成，如下图
# 变量名 赋值符号 变量值
name = "dream"  # 将 dream 这个值赋值给 name
age = 18

# 内部原理 ： 在内存中开辟一块内存空间 让这个空间存储 dream 这个值 ， 然后用 name 去指向 这个 空间地址
name = "dream"
name = "hope"

# 【3】变量名的命名规范
# (1)变量名可以是 字母(大写和小写) + 数字 + 下划线 _ 的任意组合
user_name = 'dream'
_username = "dream"
User_name = "dream"
USERO1_NAME = "dream"
# (2)数字不能作为变量名的开头
# 01_name= "dream"
# (3)关键字不能作为变量名的开头
if_user = 'dream'
# def

# 【4】变量名的命名风格
# （1）驼峰体
# 大驼峰 每一个单词的首字母大写
UserName = "dream"
# 小驼峰
# 第一个单词的首字母小写 其他是单词的首字母大写
userName = "dream"
# （2）春小写 + 下划线
user_name = "dream"

# 【五】变量的三大特性
username = "dream"
age = 18
# 变量内存地址 : 每一次在运行代码的时候都会重新开辟内存空间 存储变量值
print(id(username))  # 4340550000 4302162288 4375300464
# 变量类型 : 知道某个变量类型 ， 通过 type
print(type(username))  # <class 'str'>
print(type(age))  # <class 'int'>
# 变量值 : 直接打印变量名就能看到变量值
print(username)

# 【二】常量
# 【1】什么是常量
#  ● 常量就是指程序运行过程中值不会发生改变的量
# 【2】定义常量
#  ● 常量的定义与变量类似，只是常量值不能被改变
# 用全大写的字母来代表常量

# 在Python中的常量被定义以后是可以改变的，但是我们呢都遵循不变的规则
# 在其他语言 java go 定义常量后是不允许修改的

PORT = 3306
print(PORT)
PORT = 9936
print(PORT)

# PEP8规范 ： 官方提供的变量名命名规范
#
