# -*-coding: Utf-8 -*-
# @File : 01作日内容回顾 .py
# author: Chimengmeng
# blog_url : https://www.cnblogs.com/dream-ze/
# Time：2024/7/16

# 1.计算机的五大组成部分，各部分的功能
# 控制器 ： 控制整个硬件设备的调度
# 运算器 ： 处理计算机中的算数和运算逻辑
# 存储器 ： 存储电脑运行过程中产生的永久性数据和临时性数据
# 输入设备 ： 向计算机中输入内容
# 输出设备 ： 计算机向人展示输出的内容

# 2.计算机的三大核心硬件有哪些，主要功能是
# CPU ：计算机的控制中心，负责调度和运算
# 硬盘 ：长期（永久）存储数据
# 内存 ： 暂时（临时存储数据）

# 3.我们是用的Python解释器的版本
# 3.10 ---> CPython
# JPython


# 【一】什么是编程和编程语言
# 语言是生物与生物和生物与非生物之间沟通交流的媒介
# 语言有包括 声音 肢体语言

# 编程语言就是人与计算机之间沟通交流的媒介
# 编程：就是将人类的语言翻译成计算机可以识别的语言

# 【二】编程语言的分类
# 【1】机器语言
# 直接操作底层硬件的语言
# 表现形式是 0 / 1 二进制数据

# 优点 ：直接操作底层硬件 效率高
# 缺点 ： 学习成本大 跨平台性差
# 【2】汇编语言
# 用字母+特殊字符来代表一串二进制指令的语言

# 优点：简洁操作底层硬件 效率很高
# 缺点：学习成本高 跨平台性差

# 【3】高级语言
# 我们人类可以正常识别的语言
# 我们用的高级语言是基于操作系统之上的语言

# 缺点：执行效率低（相较于计算机来说）
# 优点：学习成本低 跨平台性好

# （1）编译型语言
# 编译型语言在执行之前需要一个专门的编译过程，将源代码编译成最终的可执行程序
# C / C++ c# / JAVA ...
# （2）解释型语言
# 边编译边执行
# Python Go PHP

# 【三】Python
# 【1】创始人：吉多范罗姆
# 【2】Python历史版本
# 1989 年 开始写
# 1991 年 发布第一个公开发行版 Python1.0
# 1994 年 发布 稳定版本 Python1.0
# 2010 年 发布 2.7 版本
# 2016 年 发布第一个稳定版本 Python3.6
# 2024 年 发布了 Python3.12.4版本

# 我们使用的版本是 Python 3.10

# 【2】Python解释器的种类
# CPython ： 使用C语言写的 Python解释器 我们使用的是 CPython
# JPython ： 使用 java 语言写的 Python解释器
# PyPY
# IronPython

# 【四】Python解释器的安装
# 【1】访问官网下载 Python解释器安装包
# python.org
# 一定要下载自己系统的安装包 64位/32位
# 32位 ---> 只能安装 32位
# 64位 ---> 能安装 64位 兼容 32位

# 【2】双击安装包安装
#  一直点击下一步 直到安装完成
# 在安装的过程中 需要修改设置

# custom installation 选择自定义安装

